CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Source/gd32w51x_hpdf.c
/*!
    \file    gd32w51x_hpdf.c
    \brief   HPDF driver

    \version 2021-03-25, V1.0.0, firmware for GD32W51x
*/

/*
    Copyright (c) 2021, GigaDevice Semiconductor Inc.

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32w51x_hpdf.h"
#include <stdlib.h>

#if defined (GD32W515PI) || defined (GD32W515P0)

/* HPDF register bit offset */
#define CH0CTL_CKOUTDIV_OFFSET              ((uint32_t)0x00000010U)               /*!< bit offset of CKOUTDIV in HPDf_CH0CTL */
#define CHyCTL_SPICKSS_OFFSET               ((uint32_t)0x00000002U)               /*!< bit offset of CKOUTDIV in HPDf_CH0CTL */
#define CHyCFG_DTRS_OFFSET                  ((uint32_t)0x00000003U)               /*!< bit offset of DTRS in HPDF_CH0CFG */
#define CHyCFG0_CALOFF_OFFSET               ((uint32_t)0x00000008U)               /*!< bit offset of CALOFF in HPDF_CH0CFG */
#define CHyCFG1_TMFOR_OFFSET                ((uint32_t)0x00000010U)               /*!< bit offset of TMFOR in CHyCFG1 */
#define FLTySFCFG_SFOR_OFFSET               ((uint32_t)0x00000010U)               /*!< bit offset of SFOR in FLTySFCFG */
#define FLTyIDATAT_IDATA_OFFSET             ((uint32_t)0x00000008U)               /*!< bit offset of IDATA in FLTyIDATA */
#define FLTyRDATAT_RDATA_OFFSET             ((uint32_t)0x00000008U)               /*!< bit offset of RDATA in FLTyRDATA */
#define FLTyTMHT_HTVAL_OFFSET               ((uint32_t)0x00000008U)               /*!< bit offset of HTVAL in FLTyTMHT */
#define FLTyTMLT_LTVAL_OFFSET               ((uint32_t)0x00000008U)               /*!< bit offset of LTVAL in FLTyTMLT */
#define FLTyEMMAX_MAXVAL_OFFSET             ((uint32_t)0x00000008U)               /*!< bit offset of MAXVAL in FLTyEMMAX */
#define FLTyEMMIN_MINVAL_OFFSET             ((uint32_t)0x00000008U)               /*!< bit offset of MINVAL in FLTyEMMIN */

#define HPDF_WRONG_HANDLE        while(1){}

/*!
    \brief      reset HPDF
    \param[in]  hpdf_periph: HPDF
    \param[out] none
    \retval     none
*/
void hpdf_deinit(void)
{
    /* reset HPDF */
    rcu_periph_reset_enable(RCU_HPDFRST);
    rcu_periph_reset_disable(RCU_HPDFRST);
}

/*!
    \brief      initialize the parameters of HPDF channel struct with the default values
    \param[in]  init_struct: the initialization data needed to initialize HPDF
                  serial_interface: EXTERNAL_CKIN, INTERNAL_CKOUT, HALF_CKOUT_FALLING_EDGE, HALF_CKOUT_RISING_EDGE
                  spi_ck_source: SPI_RISING_EDGE, SPI_FALLING_EDGE, MANCHESTER_CODE0, MANCHESTER_CODE1
                  malfunction_monitor: MM_DISABLE, MM_ENABLE
                  calibration_offset: calibration offset(-8388608 ~ 8388607)
                  right_bit_shift: data right bit-shift(0 ~ 31)
                  channel_multiplexer: SERIAL_INPUT, INTERNAL_INPUT
                  channel_pin_select: CHPINSEL_CURRENT, CHPINSEL_NEXT
                  ck_loss_detector: CLK_LOSS_DISABLE, CLK_LOSS_ENABLE
                  data_packing_mode: DPM_STANDARD_MODE, DPM_INTERLEAVED_MODE, DPM_DUAL_MODE
                  tm_filter: TM_FASTSINC, TM_SINC1, TM_SINC2, TM_SINC3
                  tm_filter_oversample: threshold monitor filter oversampling rate(0 ~ 31), AW_FLT_BYPASS=0
                  mm_break_signal: DISABLE, ENABLE
                  mm_counter_threshold: malfunction monitor counter threshold(0 ~ 255)
                  plsk_value: the number of serial input samples that will be skipped(0 ~ 63)
    \param[out] none
    \retval     none
*/
void hpdf_channel_struct_para_init(hpdf_channel_parameter_struct* init_struct)
{
    /* check whether the struct is empty */
    if(NULL == init_struct){
        HPDF_WRONG_HANDLE
    }
    /* set the struct with the default values */
    init_struct->serial_interface       = SPI_RISING_EDGE;
    init_struct->spi_ck_source          = EXTERNAL_CKIN;
    init_struct->malfunction_monitor    = MM_DISABLE;
    init_struct->calibration_offset     = 0;
    init_struct->right_bit_shift        = 0U;
    init_struct->channel_multiplexer    = SERIAL_INPUT; 
    init_struct->channel_pin_select     = CHPINSEL_CURRENT;
    init_struct->ck_loss_detector       = CLK_LOSS_DISABLE;
    init_struct->data_packing_mode      = DPM_STANDARD_MODE;
    init_struct->tm_filter              = TM_FASTSINC;
    init_struct->tm_filter_oversample   = TM_FLT_BYPASS;
    init_struct->mm_break_signal        = DISABLE;
    init_struct->mm_counter_threshold   = 0U;
    init_struct->plsk_value             = 0U;
}

/*!
    \brief      initialize the parameters of HPDF filter struct with the default values
    \param[in]  init_struct: the initialization data needed to initialize HPDF
                  sinc_filter: FLT_FASTSINC, FLT_SINC1, FLT_SINC2, FLT_SINC3, FLT_SINC4, FLT_SINC5
                  sinc_oversample: sinc filter oversampling rate(0 ~ 1023), FLT_SINC_BYPASS=0
                  integrator_oversample: integrator oversampling rate(0 ~ 255), INTEGRATOR_BYPASS=0
                  tm_fast_mode: TMFM_DISABLE, TMFM_ENABLE
                  tm_channel: TMCHEN_DISABLE, TMCHEN_CHANNEL0, TMCHEN_CHANNEL1, TMCHEN_CHANNEL0_1
                  tm_high_threshold: threshold monitor high threshold(-8388608 ~ 8388607)
                  tm_low_threshold: threshold monitor low threshold value(-8388608 ~ 8388607)
                  extreme_monitor_channel: EM_CHANNEL_DISABLE, EM_CHANNEL0, EM_CHANNEL1, EM_CHANNEL0_1
                  ht_break_signal: NO_TM_HT_BREAK, TM_HT_BREAK0, TM_HT_BREAK1, TM_HT_BREAK0_1
                  lt_break_signal: NO_TM_LT_BREAK, TM_LT_BREAK0, TM_LT_BREAK1, TM_LT_BREAK0_1
    \param[out] none
    \retval     none
*/
void hpdf_filter_struct_para_init(hpdf_filter_parameter_struct* init_struct)
{
    /* check whether the struct is empty */
    if(NULL == init_struct){
        HPDF_WRONG_HANDLE
    }
    /* set the struct with the default values */
    init_struct->sinc_filter                = FLT_FASTSINC;
    init_struct->sinc_oversample            = FLT_SINC_BYPASS;
    init_struct->integrator_oversample      = INTEGRATOR_BYPASS;
    init_struct->tm_fast_mode               = TMFM_DISABLE;
    init_struct->tm_channel                 = TMCHEN_DISABLE;
    init_struct->tm_high_threshold          = 0;
    init_struct->tm_low_threshold           = 0;
    init_struct->extreme_monitor_channel    = EM_CHANNEL_DISABLE;
    init_struct->ht_break_signal            = NO_TM_HT_BREAK;
    init_struct->lt_break_signal            = NO_TM_LT_BREAK;
}

/*!
    \brief      initialize the parameters of regular conversion struct with the default values
    \param[in]  init_struct: the initialization data needed to initialize HPDF
                  continuous_mode: RCCM_DISABLE, RCCM_ENABLE
                  fast_mode: FAST_DISABLE, FAST_ENABLE
                  rcdmaen: RCDMAEN_DISABLE, RCDMAEN_ENABLE
                  rcsyn: RCSYN_DISABLE, RCSYN_ENABLE
                  rcsyn: RCS_CHANNEL0, RCS_CHANNEL1
    \param[out] none
    \retval     none
*/
void hpdf_rc_struct_para_init(hpdf_rc_parameter_struct* init_struct)
{
    /* check whether the struct is empty */
    if(NULL == init_struct){
        HPDF_WRONG_HANDLE
    }
    /* set the struct with the default values */
    init_struct->continuous_mode        = RCCM_DISABLE;
    init_struct->fast_mode              = FAST_DISABLE;
    init_struct->rcdmaen                = RCDMAEN_DISABLE;
    init_struct->rcsyn                  = RCSYN_DISABLE;
    init_struct->rcs_channel            = RCS_CHANNEL0;
}

/*!
    \brief      initialize the parameters of inserted conversion struct with the default values
    \param[in]  init_struct: the initialization data needed to initialize HPDF
                  scmod: SCMOD_DISABLE, SCMOD_ENABLE
                  icdmaen: ICDMAEN_DISABLE, ICDMAEN_ENABLE
                  ic_channel_group: IGCSEL_CHANNEL0, IGCSEL_CHANNEL1, IGCSEL_CHANNEL0_1
                  icsyn: ICSYN_DISABLE, ICSYN_ENABLE
                  trigger_dege: TRG_DISABLE, RISING_EDGE_TRG, FALLING_EDGE_TRG, EDGE_TRG
                  trigger_signal: HPDF_ITRG0, HPDF_ITRG1, HPDF_ITRG2, HPDF_ITRG3, HPDF_ITRG24, HPDF_ITRG25, HPDF_ITRG26
    \param[out] none
    \retval     none
*/
void hpdf_ic_struct_para_init(hpdf_ic_parameter_struct* init_struct)
{
    /* check whether the struct is empty */
    if(NULL == init_struct){
        HPDF_WRONG_HANDLE
    }
    /* set the struct with the default values */
    init_struct->scmod              = SCMOD_DISABLE;
    init_struct->icdmaen            = ICDMAEN_DISABLE;
    init_struct->ic_channel_group   = IGCSEL_CHANNEL0;
    init_struct->icsyn              = ICSYN_DISABLE;
    init_struct->trigger_dege       = TRG_DISABLE;
    init_struct->trigger_signal     = HPDF_ITRG0;
}

/*!
    \brief      enable the HPDF module globally
    \param[in]  hpdf_periph: HPDF
    \param[out] none
    \retval     none
*/
void hpdf_enable(void)
{
    /* enable the HPDF module globally */
    HPDF_CHxCTL(CHANNEL0) |= HPDF_CH0CTL_HPDFEN;
}

/*!
    \brief      disable the HPDF module globally
    \param[in]  hpdf_periph: HPDF
    \param[out] none
    \retval     none
*/
void hpdf_disable(void)
{
    /* disable the HPDF module globally */
    HPDF_CHxCTL(CHANNEL0) &= ~HPDF_CH0CTL_HPDFEN;
}

/*!
    \brief      initialize the HPDF channel
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[in]  init_struct: the initialization data needed to initialize HPDF channel
    \param[out] none
    \retval     none
*/
void hpdf_channel_init(hpdf_channel_enum channelx, hpdf_channel_parameter_struct* init_struct)
{
    uint32_t reg;
    /* configure the HPDF_CH0CTL */
    reg = HPDF_CHxCTL(channelx);
    reg &= ~(HPDF_CHxCTL_SPICKSS | HPDF_CHxCTL_SITYP | HPDF_CHxCTL_MMEN | HPDF_CHxCTL_CKLEN | HPDF_CHxCTL_CHPINSEL |\
             HPDF_CHxCTL_CMSD | HPDF_CHxCTL_DPM);
    reg |= (init_struct->spi_ck_source | init_struct->serial_interface | init_struct->malfunction_monitor |\
            init_struct->channel_multiplexer | init_struct->channel_pin_select | init_struct->ck_loss_detector |\
            init_struct->data_packing_mode);
    HPDF_CHxCTL(channelx) = reg;
    /* configure the HPDF_CH0CFG0 */
    reg = HPDF_CHxCFG0(channelx);
    reg &= ~(HPDF_CHxCFG0_CALOFF | HPDF_CHxCFG0_DTRS);
    reg |= (((uint32_t)init_struct-> calibration_offset << CHyCFG0_CALOFF_OFFSET) | (init_struct->right_bit_shift << CHyCFG_DTRS_OFFSET));
    HPDF_CHxCFG0(channelx) = reg;
    /* configure the HPDF_CH0CFG1 */
    if(init_struct->tm_filter_oversample > 0U){
        init_struct->tm_filter_oversample = init_struct->tm_filter_oversample - 1U;    
    }
    reg = HPDF_CHxCFG1(channelx);
    reg &= ~(HPDF_CHxCFG1_TMSFO | HPDF_CHxCFG1_TMFOR | HPDF_CHxCFG1_MMBSD | HPDF_CHxCFG1_MMCT);
    reg |= (init_struct->tm_filter | (init_struct->tm_filter_oversample << CHyCFG1_TMFOR_OFFSET) | init_struct->mm_break_signal |\
            init_struct->mm_counter_threshold);
    HPDF_CHxCFG1(channelx) = reg;
    /* configure the HPDF_CH0PS */
    reg = HPDF_CHxPS(channelx);
    reg &= ~(HPDF_CHxPS_PLSK);
    reg |= init_struct->plsk_value;
    HPDF_CHxPS(channelx) = reg;
}

/*!
    \brief      initialize the HPDF filter
    \param[in]  filtery: FLTy(y=0,1)
    \param[in]  init_struct: the initialization data needed to initialize HPDF filter
    \param[out] none
    \retval     none
*/
void hpdf_filter_init(hpdf_filter_enum filtery, hpdf_filter_parameter_struct* init_struct)
{
    uint32_t reg;
    /* configure the HPDF_FLT0CTL0 */
    HPDF_FLTyCTL0(filtery) |= init_struct->tm_fast_mode;
    /* configure the HPDF_FLT0CTL1 */
    reg = HPDF_FLTyCTL1(filtery);
    reg &= ~(HPDF_FLTyCTL1_TMCHEN | HPDF_FLTyCTL1_EMCS);
    reg |= (init_struct->tm_channel | init_struct->extreme_monitor_channel);
    HPDF_FLTyCTL1(filtery) = reg;
    /* configure the HPDF_FLT0SFCTL*/
    if(init_struct->sinc_oversample > 0U){
        init_struct->sinc_oversample = init_struct->sinc_oversample - 1U;    
    }
    if(init_struct->integrator_oversample > 0U){
        init_struct->integrator_oversample = init_struct->integrator_oversample - 1U;    
    }
    reg = HPDF_FLTySFCFG(filtery);
    reg &= ~(HPDF_FLTySFCFG_SFO | HPDF_FLTySFCFG_SFOR | HPDF_FLTySFCFG_IOR);
    reg |= (init_struct->sinc_filter | (init_struct->sinc_oversample << FLTySFCFG_SFOR_OFFSET) | init_struct->integrator_oversample);
    HPDF_FLTySFCFG(filtery) = reg;
    /* configure the HPDF_FLT0TMHT */
    reg = HPDF_FLTyTMHT(filtery);
    reg &= ~(HPDF_FLTyTMHT_HTVAL | HPDF_FLTyTMHT_HTBSD);
    reg |= (((uint32_t)init_struct->tm_high_threshold << FLTyTMHT_HTVAL_OFFSET) | init_struct->ht_break_signal);
    HPDF_FLTyTMHT(filtery) = reg;
    /* configure the HPDF_FLT0TMLT */
    reg = HPDF_FLTyTMLT(filtery);
    reg &= ~(HPDF_FLTyTMLT_LTVAL | HPDF_FLTyTMLT_LTBSD);
    reg |= (((uint32_t)init_struct->tm_low_threshold << FLTyTMLT_LTVAL_OFFSET) | init_struct->lt_break_signal);
    HPDF_FLTyTMLT(filtery) = reg;
}

/*!
    \brief      initialize the regular conversion
    \param[in]  filtery: FLTy(y=0,1)
    \param[in]  init_struct: the initialization data needed to initialize regular conversion
    \param[out] none
    \retval     none
*/
void hpdf_rc_init(hpdf_filter_enum filtery, hpdf_rc_parameter_struct* init_struct)
{
    uint32_t reg;
    /* configure the HPDF_FLT0CTL0 */
    reg = HPDF_FLTyCTL0(filtery);
    reg &= ~(HPDF_FLTyCTL0_FAST | HPDF_FLTyCTL0_RCS | HPDF_FLTyCTL0_RCDMAEN | HPDF_FLTyCTL0_RCSYN | HPDF_FLTyCTL0_RCCM);
    reg |= (init_struct->continuous_mode | init_struct->fast_mode | init_struct->rcdmaen | init_struct->rcsyn |\
            init_struct->rcs_channel);
    HPDF_FLTyCTL0(filtery) = reg;
}

/*!
    \brief      initialize the inserted conversion
    \param[in]  filtery: FLTy(y=0,1)
    \param[in]  init_struct: the initialization data needed to initialize inserted conversion
    \param[out] none
    \retval     none
*/
void hpdf_ic_init(hpdf_filter_enum filtery, hpdf_ic_parameter_struct* init_struct)
{
    uint32_t reg;
    /* configure the HPDF_FLT0CTL0 */
    reg = HPDF_FLTyCTL0(filtery);
    reg &= ~(HPDF_FLTyCTL0_ICTEEN | HPDF_FLTyCTL0_ICTSSEL | HPDF_FLTyCTL0_ICDMAEN | HPDF_FLTyCTL0_SCMOD |\
             HPDF_FLTyCTL0_ICSYN);
    reg |= (init_struct->trigger_dege | init_struct->trigger_signal | init_struct->icdmaen | init_struct->scmod |\
                init_struct->icsyn);
    HPDF_FLTyCTL0(filtery) = reg;
    /* configure the HPDF_FLT0IGCS */
    reg = HPDF_FLTyIGCS(filtery);
    reg &= ~HPDF_FLTyIGCS_IGCSEL; 
    reg |= init_struct->ic_channel_group;
    HPDF_FLTyIGCS(filtery) = reg;
}

/*!
    \brief      configure serial output clock
    \param[in]  source: the HPDF serial clock output source
                only one parameter can be selected which is shown as below:
    \arg          SERIAL_SYSTEM_CLK: serial clock output source is from system clock
    \arg          SERIAL_AUDIO_CLK: serial clock output source is from audio clock
    \param[in]  divider: serial clock output divider 0-255
    \param[in]  mode: serial clock output duty mode
                only one parameter can be selected which is shown as below:
    \arg          CKOUTDM_DISABLE: disable serial clock output duty mode
    \arg          CKOUTDM_ENABLE: enable serial clock output duty mode
    \param[out] none
    \retval     none
*/
void hpdf_clock_output_config(uint32_t source, uint8_t divider, uint32_t mode)
{
    uint32_t reg;
    reg = HPDF_CHxCTL(CHANNEL0);
    reg &= ~(HPDF_CH0CTL_CKOUTSEL | HPDF_CH0CTL_CKOUTSEL | HPDF_CH0CTL_CKOUTDM);
    /* configure serial output clock */
    reg |= (source | ((uint32_t)divider << CH0CTL_CKOUTDIV_OFFSET) | mode);
    HPDF_CHxCTL(CHANNEL0) = reg;
}

/*!
    \brief      configure serial clock output source
    \param[in]  source: the HPDF serial clock output source
    \arg          SERIAL_SYSTEM_CLK: serial clock output source is from system clock
    \arg          SERIAL_AUDIO_CLK: serial clock output source is from audio clock
    \param[out] none
    \retval     none
*/
void hpdf_clock_output_source_config(uint32_t source)
{
    uint32_t reg;
    reg = HPDF_CHxCTL(CHANNEL0);
    reg &= ~HPDF_CH0CTL_CKOUTSEL;
    reg |= source;
    HPDF_CHxCTL(CHANNEL0) = reg;
}

/*!
    \brief      disable serial clock output duty mode
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hpdf_clock_output_duty_mode_disable(void)
{
    /* make sure the HPDF_CH0CTL_HPDFEN=0 */
    if(RESET == (HPDF_CHxCTL(CHANNEL0) & HPDF_CH0CTL_HPDFEN)){
        HPDF_CHxCTL(CHANNEL0) &= ~CKOUTDM_ENABLE;
    }
}

/*!
    \brief      enable serial clock output duty mode
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hpdf_clock_output_duty_mode_enable(void)
{
    /* make sure the HPDF_CH0CTL_HPDFEN=0 */
    if(RESET == (HPDF_CHxCTL(CHANNEL0) & HPDF_CH0CTL_HPDFEN)){
        HPDF_CHxCTL(CHANNEL0) |= CKOUTDM_ENABLE;
    }
}

/*!
    \brief      configure serial clock output divider
    \param[in]  divider: serial clock output divider 0-255
    \param[out] none
    \retval     none
*/
void hpdf_clock_output_divider_config(uint8_t divider)
{
    uint32_t reg;
    /* make sure the HPDF_CH0CTL_HPDFEN=0 */
    if(RESET == (HPDF_CHxCTL(CHANNEL0) & HPDF_CH0CTL_HPDFEN)){
        reg = HPDF_CHxCTL(CHANNEL0);
        reg &= ~HPDF_CH0CTL_CKOUTDIV;
        reg |= ((uint32_t)divider << CH0CTL_CKOUTDIV_OFFSET);
        HPDF_CHxCTL(CHANNEL0) = reg;
    }
}

/*!
    \brief      enable the HPDF channel
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_channel_enable(hpdf_channel_enum channelx)
{
    HPDF_CHxCTL(channelx) |= HPDF_CHxCTL_CHEN;
}

/*!
    \brief      disable the HPDF channel
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_channel_disable(hpdf_channel_enum channelx)
{
    HPDF_CHxCTL(channelx) &= ~HPDF_CHxCTL_CHEN;
}

/*!
    \brief      configure SPI clock source
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[in]  clock_source: SPI clock source
                only one parameter can be selected which is shown as below:
    \arg          EXTERNAL_CKIN: external input clock 
    \arg          INTERNAL_CKOUT: internal CKOUT clock 
    \arg          HALF_CKOUT_FALLING_EDGE: internal CKOUT clock, sampling point on each second CKOUT falling edge
    \arg          HALF_CKOUT_RISING_EDGE: internal CKOUT clock, sampling point on each second CKOUT rising edge
    \param[out] none
    \retval     none
*/
void hpdf_spi_clock_source_config(hpdf_channel_enum channelx, uint32_t clock_source)
{
    uint32_t reg;
    reg = HPDF_CHxCTL(channelx);
    /* make sure the CHEN=0 */
    if(RESET == (reg & HPDF_CHxCTL_CHEN)){
        reg &= ~HPDF_CHxCTL_SPICKSS;
        reg |= clock_source;
        HPDF_CHxCTL(channelx) = reg;
    }
}

/*!
    \brief      configure serial interface type
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[in]  type: serial interface type
                only one parameter can be selected which is shown as below:
    \arg          SPI_RISING_EDGE: SPI interface, sample data on rising edge 
    \arg          SPI_FALLING_EDGE: SPI interface, sample data on rising edge
    \arg          MANCHESTER_CODE0: Manchester coded input: rising edge = logic 0, falling edge = logic 1
    \arg          MANCHESTER_CODE1: Manchester coded input: rising edge = logic 1, falling edge = logic 0
    \param[out] none
    \retval     none
*/
void hpdf_serial_interface_type_config(hpdf_channel_enum channelx, uint32_t type)
{
    uint32_t reg;
    reg = HPDF_CHxCTL(channelx);
    /* make sure the CHEN=0 */
    if(RESET == (reg & HPDF_CHxCTL_CHEN)){
        reg &= ~HPDF_CHxCTL_SITYP; 
        reg |= type;
        HPDF_CHxCTL(channelx) = reg;
    }
}

/*!
    \brief      disable malfunction monitor 
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_malfunction_monitor_disable(hpdf_channel_enum channelx)
{
    HPDF_CHxCTL(channelx) &= ~HPDF_CHxCTL_MMEN;
}
/*!
    \brief      enable malfunction monitor 
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_malfunction_monitor_enable(hpdf_channel_enum channelx)
{
    HPDF_CHxCTL(channelx) |= HPDF_CHxCTL_MMEN;
}

/*!
    \brief      disable clock loss detector 
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_clock_loss_disable(hpdf_channel_enum channelx)
{
    HPDF_CHxCTL(channelx) &= ~HPDF_CHxCTL_CKLEN;
}

/*!
    \brief      enable clock loss detector 
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_clock_loss_enable(hpdf_channel_enum channelx)
{
    HPDF_CHxCTL(channelx) |= HPDF_CHxCTL_CKLEN;
}

/*!
    \brief      disable channel inputs pins redirection
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_channel_pin_redirection_disable(hpdf_channel_enum channelx)
{
    /* make sure the CHEN=0 */
    if(RESET == (HPDF_CHxCTL(channelx) & HPDF_CHxCTL_CHEN)){
        HPDF_CHxCTL(channelx) &= ~HPDF_CHxCTL_CHPINSEL;
    }
}

/*!
    \brief      enable channel inputs pins redirection
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[out] none
    \retval     none
*/
void hpdf_channel_pin_redirection_enable(hpdf_channel_enum channelx)
{
    /* make sure the CHEN=0 */
    if(RESET == (HPDF_CHxCTL(channelx) & HPDF_CHxCTL_CHEN)){
        HPDF_CHxCTL(channelx) |= HPDF_CHxCTL_CHPINSEL;
    }
}

/*!
    \brief      configure channel multiplexer select input data source
    \param[in]  channelx: CHANNELx(x=0,1)
    \param[in]  data_source: input data source
                only one parameter can be selected which is shown as below:
    \arg          SERIAL_INPUT: input data source is taken from serial inputs 
    \arg          INTERNAL_INPUT: input data source is taken from internal HPDF_CHxPDI register
    \param[out] none
    \retval     none
*/
void hpdf_channel_multiplexer_config(hpdf_channel_enum channelx, uint32_t data_source)
{
    uint32_t reg;
    reg = HPDF_CHxCTL(channelx);
    /* make sure the CHEN=0 */
    if(RESET == (reg & HPDF_CHxCTL_CHEN)){
        reg &= ~HPDF_CHxCTL_CMSD;
        /* configure the input data source */
        reg |= data_source;
        HPDF_CHxCTL(channelx) = reg;
    }
}

