CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Source/gd32w51x_hpdf.c
    /* get the flag position */
    val = BIT(HPDF_BIT_POS(flag));
    /* make sure the range of flag position */
    val = (uint8_t)(((val >= BIT(HPDF_BIT_POS(HPDF_FLAG_FLTy_LTF0))) && (val <= BIT(HPDF_BIT_POS(HPDF_FLAG_FLTy_HTF1)))) ? SET : RESET);
    if(HPDF_FLAG_FLTy_TMEOF == flag){
        /* clear the threshold monitor flag */
        HPDF_FLTyTMFC(filtery)|= (HPDF_FLTyTMFC_HTFC | HPDF_FLTyTMFC_LTFC); 
    }else{
        switch (val){
        case SET:
            if(HPDF_FLAG_FLTy_ICEF == flag){
                /* clear inserted conversion end flag */
                HPDF_FLTyIDATA(filtery);
            }else if(HPDF_FLAG_FLTy_RCEF == flag){
                /* clear regular conversion end flag */
                HPDF_FLTyRDATA(filtery);
            }else{
                /* clear threshold monitor high threshold flag */
                HPDF_FLTyTMFC(filtery) |= BIT(HPDF_BIT_POS(flag));
            }
            break;
        case RESET:
            /* clear the flag by HPDF_FLTyINTC register */ 
            HPDF_FLTyINTC(filtery) |= BIT(HPDF_BIT_POS(flag));
            break;
        default :
            break;
        }
    }
}

/*!
    \brief      enable HPDF interrupt
    \param[in]  hpdf_fltx: FLTy(y=0,1)
    \param[in]  interrupt: HPDF interrupts, refer to hpdf_interrput_enum
                only one parameter can be selected which is shown as below:
      \arg        HPDF_INT_FLTy_ICEIE: FLTy inserted conversion end interrupt enable
      \arg        HPDF_INT_FLTy_RCEIE: FLTy regular conversion end interrupt enable
      \arg        HPDF_INT_FLTy_ICDOIE: FLTy inserted conversion data overflow interrupt enable
      \arg        HPDF_INT_FLTy_RCDOIE: FLTy regular conversion data overflow interrupt enable
      \arg        HPDF_INT_FLTy_TMEOIE: FLTy threshold monitor interrupt enable
      \arg        HPDF_INT_FLT0_MMIE: malfunction monitor interrupt enable
      \arg        HPDF_INT_FLT0_CKLIE: clock loss interrupt enable
    \param[out] none
    \retval     none
*/
void hpdf_interrupt_enable(hpdf_filter_enum filtery, hpdf_interrput_enum interrupt)
{
    if(FLT0 == filtery){
        HPDF_REG_VAL(HPDF_FLT0, interrupt) |= BIT(HPDF_BIT_POS(interrupt));
    }else{
        HPDF_REG_VAL(HPDF_FLT1, interrupt) |= BIT(HPDF_BIT_POS(interrupt));
    }
}

/*!
    \brief      disable HPDF interrupt
    \param[in]  hpdf_fltx: FLTy(y=0,1)
    \param[in]  interrupt: HPDF interrupts, refer to hpdf_interrput_enum
                only one parameter can be selected which is shown as below:
      \arg        HPDF_INT_FLTy_ICEIE: FLTy inserted conversion interrupt enable
      \arg        HPDF_INT_FLTy_RCEIE: FLTy regular conversion interrupt enable
      \arg        HPDF_INT_FLTy_ICDOIE: FLTy inserted conversion data overflow interrupt enable
      \arg        HPDF_INT_FLTy_RCDOIE: FLTy regular conversion data overflow interrupt enable
      \arg        HPDF_INT_FLTy_TMEOIE: FLTy threshold monitor interrupt enable
      \arg        HPDF_INT_FLT0_MMIE: malfunction monitor interrupt enable
      \arg        HPDF_INT_FLT0_CKLIE: clock loss interrupt enable
    \param[out] none
    \retval     none
*/
void hpdf_interrupt_disable(hpdf_filter_enum filtery, hpdf_interrput_enum interrupt)
{
    if(FLT0 == filtery){
        HPDF_REG_VAL(HPDF_FLT0, interrupt) &= BIT(HPDF_BIT_POS(interrupt));
    }else{
        HPDF_REG_VAL(HPDF_FLT1, interrupt) &= BIT(HPDF_BIT_POS(interrupt));
    }
}

/*!
    \brief      get the HPDF interrupt flags
    \param[in]  hpdf_fltx: FLTy(y=0,1)
    \param[in]  interrupt: HPDF flags, refer to hpdf_interrput_enum
                only one parameter can be selected which is shown as below:
      \arg        HPDF_INT_FLAG_FLTy_ICEF: FLTy inserted conversion end interrupt flag
      \arg        HPDF_INT_FLAG_FLTy_RCEF: FLTy regular conversion end interrupt flag
      \arg        HPDF_INT_FLAG_FLTy_ICDOF: FLTy inserted conversion data overflow interrupt flag
      \arg        HPDF_INT_FLAG_FLTy_RCDOF: FLTy regular conversion data overflow interrupt flag
      \arg        HPDF_INT_FLAG_FLTy_TMEOF: FLTy threshold monitor event occurred interrupt flag
      \arg        HPDF_INT_FLAG_FLT0_CKLF0: clock signal is lost on channel 0 interrupt flag
      \arg        HPDF_INT_FLAG_FLT0_CKLF1: clock signal is lost on channel 1 interrupt flag
      \arg        HPDF_INT_FLAG_FLT0_MMF0: malfunction event occurred on channel 0 interrupt flag
      \arg        HPDF_INT_FLAG_FLT0_MMF1: malfunction event occurred on channel 1 interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus hpdf_interrupt_flag_get(hpdf_filter_enum filtery, hpdf_interrput_flag_enum int_flag)
{
    uint32_t int_enable = 0U, flagstatus = 0U;
    if(FLT0 == filtery){
        /* get the interrupt enable bit status */
        int_enable = (HPDF_REG_VAL(HPDF_FLT0, int_flag) & BIT(HPDF_BIT_POS(int_flag)));
        /* get the interrupt enable bit status */
        flagstatus = (HPDF_REG_VAL2(HPDF_FLT0, int_flag) & BIT(HPDF_BIT_POS2(int_flag)));
        if(flagstatus && int_enable){
            return SET;
        }else{
            return RESET; 
        }
    }else{
        /* get the interrupt enable bit status */
        int_enable = (HPDF_REG_VAL(HPDF_FLT1, int_flag) & BIT(HPDF_BIT_POS(int_flag)));
        /* get the interrupt enable bit status */
        flagstatus = (HPDF_REG_VAL2(HPDF_FLT1, int_flag) & BIT(HPDF_BIT_POS2(int_flag)));
        if(flagstatus && int_enable){
            return SET;
        }else{
            return RESET; 
        }
    }
}

/*!
    \brief      clear the HPDF interrupt flags
    \param[in]  hpdf_fltx: FLTy(y=0,1)
    \param[in]  interrupt: HPDF flags, refer to hpdf_interrput_enum
                only one parameter can be selected which is shown as below:
      \arg        HPDF_INT_FLAG_FLTy_ICEF: FLTy inserted conversion end interrupt flag
      \arg        HPDF_INT_FLAG_FLTy_RCEF: FLTy regular conversion end interrupt flag
      \arg        HPDF_INT_FLAG_FLTy_ICDOF: FLTy inserted conversion data overflow interrupt flag
      \arg        HPDF_INT_FLAG_FLTy_RCDOF: FLTy regular conversion data overflow interrupt flag
      \arg        HPDF_INT_FLAG_FLTy_TMEOF: FLTy threshold monitor event occurred interrupt flag
      \arg        HPDF_INT_FLAG_FLT0_CKLF0: clock signal is lost on channel0 interrupt flag
      \arg        HPDF_INT_FLAG_FLT0_CKLF1: clock signal is lost on channel1 interrupt flag
      \arg        HPDF_INT_FLAG_FLT0_MMF0: malfunction event occurred on channel0 interrupt flag
      \arg        HPDF_INT_FLAG_FLT0_MMF1: malfunction event occurred on channel1 interrupt flag
    \param[out] none
    \retval     none
*/
void hpdf_interrupt_flag_clear(hpdf_filter_enum filtery, hpdf_interrput_flag_enum int_flag)
{
    if(HPDF_INT_FLAG_FLTy_ICEF == int_flag){
        /* read the inserted conversion data */
        HPDF_FLTyIDATA(filtery);
    }else if(HPDF_INT_FLAG_FLTy_RCEF == int_flag){
        /* read the regular conversion data */
        HPDF_FLTyRDATA(filtery);
    }else{
        HPDF_FLTyINTC(filtery) |= BIT(HPDF_BIT_POS2(int_flag)); 
    }
}

#endif /* GD32W515PI and GD32W515P0 */ 
